const schoolData = {
    "lastUpdate": "2025-12-05",
    "announcements": [
        {
            "text": "يُرجى من جميع المعلمين تسليم كشوف الدرجات قبل نهاية الأسبوع",
            "urgent": true
        }
    ],
    "weekEvents": {
        "sunday": {
            "title": "الأحد",
            "events": [
                "ASDfvasdfasdfas"
            ]
        },
        "monday": {
            "title": "الإثنين",
            "events": [
                "اىةى"
            ]
        },
        "tuesday": {
            "title": "الثلاثاء",
            "events": [
                "لاةىتغبل"
            ]
        },
        "wednesday": {
            "title": "الأربعاء",
            "events": [
                "بلاة"
            ]
        },
        "thursday": {
            "title": "الخميس",
            "events": [
                "ورشة التكنولوجيا للمعلمين - 1 ظهراً",
                "توزيع شهادات التفوق الشهرية 🎖️",
                "تسليم تقارير نهاية الشهر"
            ]
        }
    },
    "reminders": [
        "تسليم كشوف الدرجات قبل الخميس!"
    ],
    "weekTitle": "📚 الأسبوع الثاني - شهر ديسمبر 2025"
};