const schoolData = {
    "lastUpdate": "2025-12-06",
    "announcements": [
        {
            "text": "حتفال اخر الفصل  الدفع ممنوع يكون اكثر من 10 שח",
            "urgent": true
        }
    ],
    "weekEvents": {
        "sunday": {
            "title": "الأحد",
            "events": [
                "امتحان تربيه اسلامية - حصة واحده "
            ]
        },
        "monday": {
            "title": "الإثنين",
            "events": [
                "امتحان جغرافيا - حصة واحده "
            ]
        },
        "tuesday": {
            "title": "الثلاثاء",
            "events": [
                "امتحان علوم - حصتان"
            ]
        },
        "wednesday": {
            "title": "الأربعاء",
            "events": []
        },
        "thursday": {
            "title": "الخميس",
            "events": [
                "امتحان لغة عربية - حصتان"
            ]
        }
    },
    "reminders": [
        "ارجوا ارسال جميع مواد الامتحان للاهل على المجموعه الصفيه "
    ],
    "weekTitle": "📚 الأسبوع الثاني - شهر ديسمبر 2025"
};